package Lesson_8;
/*  Система гибкого планирования.
    На день ставятся не более трех задач, также может быть неограниченное количество встреч.
Встречи привязаны ко времени, задачи нет.
Таски могут быть двух типов - встреча, задача.
    Данные таски - название, описание.
    Задача - категория, список действий.
    Встреча - список присутствующих, время и место проведения.
Операции над задачами: создать, удалить, списать потраченное время на задачу, пометить как сделанное/несделанное.
Система должна учитывать количество потраченных часов на задачи и встречи, а также сделанные задачи.

 */
public class Lesson_8 {
    public static void main(String[] args) {

    Shedule shedule = new Shedule ();




    }
}
